<?php

# Перевіряємо, чи дозволено інсталяцію і чи існує файл інсталяції, але лише якщо вмикнений режим налагодження (app_debug == true)
if (config('app_no_install') && is_file(ROOT . '/install.php') && config('app_debug')) {
    # Перевіряємо, чи не перебуваємо вже на сторінці інсталяції
    if (PHP_SELF !== '/install.php') {
        # Перенаправляємо користувача на сторінку інсталяції, якщо він ще не там
        header('Location: /install.php');
        # Завершуємо виконання скрипта після перенаправлення
        exit;
    }
}
